Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཚེ་དགེ་སློང་ཞིག་གིས་རྒྱལ་ཁྲིད་ནས། །རིན་ཆེན་བརྩེགས་པ་དེ་ཡི་གནས་སུ་ཕྱིན།
en: At that time, a bhikṣu led the way and the king Came to the dwelling of Ratnoccaya.

source: །གནས་ཁང་ནང་དུ་ལུས་ནི་དྲང་བསྲང་སྟེ། །འོད་དང་མཚན་མཆོག་ལུས་ཀུན་ཁྱབ་པར་མཐོང་།
en: He saw him inside the dwelling, sitting upright, His body permeated by light and perfect signs. “

source: །རྒྱལ་པོ་དེ་ལ་འདི་ནི་རིན་ཆེན་བརྩེགས། །མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་གྱུར་འདི་ལྟ་སྟེ། །གསེར་འོད་དམ་པ་ཤིན་ཏུ་གྱ་ནོམ་མཆོག །སངས་རྒྱས་སྤྱོད་ཡུལ་ཟབ་མོ་འཛིན་ཅེས་སྨྲས།
en: The bhikṣu told the king, ‘This is Ratnoccaya, And the supreme king of the sūtras is this: The extremely wonderful Sublime Golden Light, Which has the profound range of activity of the buddhas.’ “

source: །རྒྱལ་པོས་རིན་ཆེན་བརྩེགས་ལ་ཕྱག་བྱས་ནས།
en: The king bowed down to Ratnoccaya.

source: །གུས་པས་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་སྨྲས། །ཟླ་བ་ཉ་ལྟར་ཞལ་མདོག་མཛེས་གྱུར་པ། །གསེར་འོད་དམ་པའི་ཆོས་འདི་བཤད་དུ་གསོལ།
en: With palms together in reverence, he said, ‘I request you, whose face is as beautiful as the full moon, To teach this Dharma of The Sublime Golden Light.’ “

source: །རིན་ཆེན་བརྩེགས་ཀྱིས་རྒྱལ་པོའི་ཚིག་མཉན་ནས། །གསེར་འོད་དམ་པ་འདི་ནི་བཤད་གནང་བས།
en: When Ratnoccaya had heard the words of the king, He gave the teaching of Sublime Golden Light.

source: །སྟོང་གསུམ་འཇིག་རྟེན་ཁམས་འདི་ཀུན་ཁྱབ་པའི། །ལྷ་མི་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་འགྱུར།
en: All the devas and humans throughout the entirety Of the world realms of the trichiliocosm were overjoyed. “

source: །རྒྱལ་པོས་ས་ཕྱོགས་ཡངས་ཤིང་གཙང་མའི་གནས། །རིན་ཆེན་གྱ་ནོམ་མཆོག་གིས་རབ་བརྒྱན་ཏེ། །སྤོས་ཆུ་དམ་པ་དག་གིས་ཆག་ཆག་བཏབ། །མེ་ཏོག་སྣ་ཚོགས་དག་ནི་གཅལ་དུ་བཀྲམ།
en: The king adorned with supreme wonderful jewels A place that was a vast and clean location, And he sprinkled it with excellent scented water And scattered there a display of a variety of flowers. “

source: །གནས་མཆོག་དེར་ནི་སྟན་མཐོ་རབ་བཏིང་སྟེ། །བ་དན་བླ་རེ་བྲེས་ནས་མཛེས་པར་བྱས།
en: In that perfect location he placed a high throne And beautified it with flags and a canopy.

source: །ཕྱེ་མ་བྱུག་སྤོས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །བདུག་པ་དག་ནི་ཀུན་དུ་ཁྱབ་པར་བྱས།
en: And he perfumed everywhere with Various powders, ointments, and incenses. “

source: །ལྷ་ཀླུ་ལྷ་མ་ཡིན་དང་མི་འམ་ཅི། །ལྟོ་འཕྱེ་ཆེན་པོ་དང་ནི་གནོད་སྦྱིན་དང་། །ལྷ་རྣམས་མན་དཱ་ར་བའི་ཆར་ཕབ་ནས། །ཐམས་ཅད་ཉེར་འོངས་སྟན་མཆོག་དེ་ལ་མཆོད།
en: Devas, nāgas, asuras, kinnaras, Mahoragas, and yakṣas rained down Divine coral tree flowers, and then they all Came to the supreme throne and made offerings to it. “

source: །གཞན་ཡང་ལྷ་ནི་འབུམ་ཕྲག་བརྒྱ་སྟོང་རྣམས། །དམ་ཆོས་ཉན་མོས་ཐམས་ཅད་དེར་ནི་འདུས། །ཆོས་སྨྲ་དང་པོ་སྟན་ལས་ལངས་པའི་ཚེ། །ཐམས་ཅད་ལྷ་ཡི་མེ་ཏོག་དག་གིས་མཆོད།
en: Another ten thousand million devas, Wishing to hear the Dharma, all gathered there, And when the dharmabhāṇaka first rose from his seat, They all made offerings to him of divine flowers. “

source: །དེ་ཚེ་ཆོས་སྨྲ་ཆེན་པོ་རིན་ཆེན་བརྩེགས། །ཤིན་ཏུ་ལུས་བཀྲུས་གོས་གཙང་རབ་བགོས་ཏེ། །ཚོགས་ཆེན་ཆོས་སྟན་དེ་དྲུང་སོང་ནས་ནི། །ཐལ་སྦྱར་རྩེ་གཅིག་སེམས་ཀྱིས་གུས་ཕྱག་བྱས།
en: At that time, the dharmabhāṇaka Ratnoccaya Thoroughly washed his body and put on clean robes, And then he came before the throne in that great assembly And single-mindedly, with palms together, bowed to it with reverence. “

source: །ལྷ་དབང་ལྷ་ཚོགས་ལྷ་ཡི་བུ་མོ་རྣམས། །ཐམས་ཅད་མེ་ཏོག་མན་དཱ་ར་ཡང་གཏོར། །ལྷ་ཡི་རོལ་མོ་བརྒྱ་སྟོང་བསམ་མི་ཁྱབ། །མཁའ་ལ་གནས་ནས་སྒྲ་དབྱངས་སྙན་པར་ཕྱུང་།
en: The deva lords, the assembled devas, and the devīs Also all scattered coral tree flowers, And with countless hundreds of thousands of divine musical instruments, They emitted the sound of beautiful music while residing in the sky. “

source: །དེ་ཚེ་ཆོས་སྨྲ་ཆེན་པོ་རིན་ཆེན་བརྩེགས། །སྟན་ལ་འདུག་སྟེ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས། །ཕྱོགས་བཅུའི་ཞིང་ན་བཞུགས་པའི་བྱམས་ཆེན་གཙོ། །བྱེ་བ་བརྒྱ་སྟོང་དེ་དག་ཡིད་ལ་བསམས།
en: At that time, the dharmabhāṇaka bhikṣu Ratnoccaya Sat on the throne, cross-legged, And contemplated in his mind the trillion Lords of great love in the realms in the ten directions. “

source: །སྡུག་བསྔལ་སེམས་ཅན་ཐམས་ཅད་ཇི་སྙེད་པ། །ཐམས་ཅད་བྱམས་སེམས་མཉམ་པ་ཉེར་གཞག་ནས། །གསོལ་འདེབས་བདག་པོ་རྒྱལ་པོ་ལེགས་པའི་ཕྱིར། །གསེར་འོད་དམ་པའི་མདོ་སྡེ་རབ་ཏུ་བཤད།
en: Maintaining a loving mind equally toward All the beings there were who were in suffering, For the sake of the supplicant, King Susaṃbhava, He taught The Sūtra of the Sublime Golden Light. “

source: །རྒྱལ་པོས་དེ་འདྲའི་ཆོས་ནི་ཐོས་གྱུར་ནས། །ཐལ་སྦྱར་རྩེ་གཅིག་རྗེས་སུ་ཡི་རང་སྨྲས།
en: When the king had heard such a Dharma, With palms together, single-mindedly he rejoiced.

source: །ཡ་མཚན་ཆོས་ཐོས་མཆི་མ་བླགས་ཏེ་ངུས། །ལུས་དང་སེམས་ནི་དགའ་ཆེན་ཀུན་ཁྱབ་གྱུར། །དེ་ཚེ་ཡུལ་བདག་རྒྱལ་པོ་ལེགས་སྐྱེས་ཀྱིས། །མདོ་སྡེ་འདི་ནི་མཆོད་པར་འདོད་པའི་ཕྱིར།
en: Hearing the wonderful Dharma, he shed tears and wept, And his body and mind were pervaded by great joy. “

source: །ལག་ན་ཡིད་བཞིན་ནོར་བུ་ཐོགས་ནས་ནི། །སེམས་ཅན་ཀུན་ཕྱིར་སྨོན་ལམ་འདི་སྐད་བཏབ། །འཛམ་གླིང་འདི་ནི་ཀུན་དུ་ཁྱབ་པར་ཡང་། །རིན་ཆེན་རྒྱན་ཕྲེང་ཆར་ནི་རབ་ཕབ་ནས། །ནོར་དང་ཡོ་བྱད་རྒུད་ཕོངས་ཇི་སྙེད་པ།
en: At that time, the lord of the realm, King Susaṃbhava, Wishing to make an offering to this sūtra, Held in his hands a wish-fulfilling jewel, And for the sake of all beings, he made this prayer: “ ‘May there fall a rain of strings of jewels That pervades the entirety of Jambudvīpa, And may everyone who is lacking in wealth and necessities All attain the happiness that they wish for.’ “

source: །ཐམས་ཅད་ཡིད་བཞིན་བདེ་བ་མྱོང་བར་ཤོག །དེ་ནས་རིན་ཆེན་སྣ་བདུན་ཆར་ཕབ་ནས། །གླིང་བཞི་ཀུན་དུ་ཆོག་ཅིང་ཚིམ་བྱས་པས། །ལུས་ཀྱི་རྒྱན་ཕྲེང་གོས་དང་ཟས་སྐོམ་དང་། །ཅི་དང་ཅི་འདོད་ཕོངས་པ་མེད་པར་གྱུར།
en: Then there fell a rain of the seven jewels, Bringing satisfaction and contentment throughout the four continents So that no one lacked jewelry for their bodies, Or clothes, food, drink, or whatever they desired. “

source: །དེ་ཚེ་ཡུལ་བདག་རྒྱལ་པོ་ལེགས་སྐྱེས་ཀྱིས། །གླིང་བཞི་རིན་ཆེན་ཆར་བབ་མཐོང་བ་དང་། །ཐམས་ཅད་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཕུད་ཀྱི། །བསྟན་ལ་ཞུགས་པའི་དགེ་སློང་དགེ་འདུན་མཆོད།
en: At that time, the lord of the realm, King Susaṃbhava, Saw the rain of jewels fall onto the four continents, And he offered it all to the saṅgha of bhikṣus Who followed the teaching of the Buddha Ratnaśikhin. “

source: །འདས་པའི་རྒྱལ་པོ་ལེགས་སྐྱེས་གང་ཡིན་པ། །ཤཱཀྱ་ཐུབ་པ་ང་ཡིན་ཤེས་པར་བྱོས།
en: Know that I, the Tathāgata Śākyamuni, Was Susaṃbhava, that king in the past.

source: །སྔོན་ཡང་ས་ཆེན་མང་པོ་རབ་བཏང་སྟེ། །རིན་ཆེན་དག་གིས་གླིང་བཞི་ཡོངས་སུ་བཀང་།
en: In the past I have offered up many great earths And filled the four continents with jewels. “

source: །སྔོན་ཚེ་ཆོས་མཁན་ཆེན་པོ་རིན་ཆེན་བརྩེགས། །ལེགས་སྐྱེས་དེ་ལ་གྱ་ནོམ་ཆོས་བཤད་དེ། །མདོ་སྡེའི་རྒྱལ་པོ་དེ་དག་བཤད་པའི་ཕྱིར། །ཤར་ཕྱོགས་སངས་རྒྱས་མི་འཁྲུགས་གྲུབ་པ་ཡིན།
en: That great Dharma master in the past, Ratnoccaya, Who taught that wonderful Dharma to Susaṃbhava, Became the eastern buddha Akṣobhya Because of teaching that king of sūtras. “

source: །ངས་ནི་མདོ་སྡེའི་རྒྱལ་པོ་འདི་མཉན་ནས། །ཐལ་སྦྱར་རྩེ་གཅིག་ཡི་རང་བརྗོད་པ་དང་། །རིན་ཆེན་སྣ་བདུན་བཏང་བའི་བསོད་ནམས་ཀྱིས། །རྡོ་རྗེ་སྐུ་མཆོག་འདི་ནི་བརྙེས་པ་ཡིན།
en: I have attained this supreme vajra body because of The merit from having listened to this king of sūtras, With palms together, having single-mindedly rejoiced And having offered up the seven kinds of jewels. “

source: །གསེར་འོད་བསོད་ནམས་བརྒྱ་ཡི་མཚན་བརྒྱན་པས།
en: It is beautified by golden light and the signs of a hundred merits.

source: །མཐོང་བ་ཐམས་ཅད་ཀུན་ནི་རབ་དགའ་ཞིང་།
en: It brings supreme joy to everyone who sees it.

source: །སེམས་ཅན་ཐམས་ཅད་ཀུན་གྱི་སྙིང་དུ་སྡུག །ལྷ་ཚོགས་མང་པོ་བྱེ་བ་ཀུན་དེ་བཞིན།
en: It is beloved by everyone, by all beings, And also by all the many millions of devas. “

source: །འདས་ཚེ་བསྐལ་པ་བྱེ་བ་དགུ་བཅུ་དགུ། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དག་ཀྱང་བྱས། །ཡུལ་ཁམས་ཆུང་ངུར་མི་ཡི་རྒྱལ་པོ་བྱས།
en: Also, in the past, I became a cakravartin king For nine hundred and ninety million eons, And have been the king of smaller kingdoms.

source: །གཞན་ཡང་བསྐལ་པ་བརྒྱ་སྟོང་ཚད་མེད་སྙེད། །བརྒྱ་བྱིན་ལྷ་ཡི་དབང་པོ་དག་ཀྱང་བྱས། །ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་དག་བྱས་ཏེ། །ཕྱོགས་བཅུའི་བྱམས་ཆེན་གཙོ་ལ་མཆོད་པ་ཡི། །དེ་ཡི་གྲངས་ཚད་ཤིན་ཏུ་མཐར་ཐུག་དཀའ།
en: Moreover, for countless hundreds of thousands of eons “I have also been Śakras, who were the lords of the devas, And I have been great Brahmā kings, And it would be difficult to know the full number of times That I made offering to the lords of great love in the ten directions. “

source: །ངས་སྔོན་མདོ་ཐོས་རྗེས་སུ་ཡི་རང་དགེ། །བསོད་ནམས་ཕུང་པོ་ཅི་ཡོད་ཚད་ཤེས་དཀའ།
en: It would be difficult to know the extent of the accumulation of merit from My good action of having in the past listened to and rejoiced in this sūtra.

source: །བསོད་ནམས་དེ་དབང་བྱང་ཆུབ་མངོན་རྟོགས་ནས། །ཆོས་སྐུ་ཡང་དག་ཡེ་ཤེས་དམ་པ་བརྙེས།
en: It is through the power of that merit that I realized enlightenment And attained the sublime true wisdom of the Dharma body.”

source: །དེ་ནས་འཁོར་མང་པོ་རྣམས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་པས་ངོ་མཚར་རྨད་དུ་གྱུར་ནས་ཐམས་ཅད་ཀྱིས་མདོ་སྡེ་གསེར་འོད་དམ་པ་སྤེལ་ཞིང་རྒྱུན་མི་འཆད་པར་སྤྱད་པར་མོས་པར་གྱུར་ཏོ།
en: Then that great assembly, having heard the words of that teaching, greatly marveled at it, and they all aspired to continuously promulgate and practice The Sūtra of the Sublime Golden Light.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་རྒྱལ་པོ་ལེགས་སྐྱེས་ཀྱི་ལེའུ་སྟེ་ཉི་ཤུ་གཅིག་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དཔལ་གྱི་ལྷ་མོ་ཆེན་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤིན་ཏུ་དང་བའི་སེམས་དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུའམ། །རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་འདས་པ་དང་། །མ་བྱོན་པ་དང་། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་རྣམས་ལ་མཆོད་པའི་ཡོ་བྱད་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: This concludes “King Susaṃbhava,” the twenty-first chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: ཡངས་ཤིང་རྒྱ་ཆེ་བ་དག་གིས་མཆོད་པར་བྱེད་པར་འདོད་པ་དང་། དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཟབ་མོ་ཤེས་ཤིང་རྟོགས་པར་འདོད་པ་གང་ཡིན་པ་དེས་གདོན་མི་ཟ་བར་སེམས་རྩེ་གཅིག་ཏུ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། རི་འམ། ནགས་ཚལ་གང་ཡང་རུང་སྟེ།
en: Chapter 22: Protection and Care from Devas and Yakṣas Then the Bhagavat said to the great goddess Śrī, “Any noble man or noble woman who has a trusting mind and faith and wishes to make an inconceivable, vast, and great offering of requisites to the past, future, and present buddhas, and wishes to know and realize the profound field of activity of the buddhas of the three times, whether dwelling in a town, in a market town, or on a mountain, should without doubt and single-mindedly teach extensively and promulgate this king of sūtras there.

source: གནས་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ནས་ཡོངས་སུ་སྤེལ་བར་བྱའོ། །ཆོས་ཉན་པ་གང་ཡིན་པ་དེ་ཡང་རྣམ་པར་གཡེང་བའི་འདུ་ཤེས་སྤངས་ནས་རྣ་བླགས་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་གཞག་པར་བྱའོ།
en: Those who listen to the Dharma should avoid distraction and be single-minded.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་མོ་དེ་དང་འཁོར་མང་པོ་རྣམས་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། གང་ཞིག་སངས་རྒྱས་མང་པོ་ལ། །བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་དང་། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི། །སྤྱོད་ཡུལ་ཟབ་མོ་ཤེས་འདོད་ན། །གལ་ཏེ་གསེར་འོད་དམ་པ་འདི། །ཡང་དག་ཕྱེ་བཤད་མཐོང་གྱུར་ན། །དེ་ཡི་ཕྱོགས་སུ་ཉེར་སོང་ནས།
en: The Bhagavat then recited these verses to the goddess and the great assembly: “Someone who wishes to make an Inconceivable offering to many buddhas And wishes to know the profound Field of activity of all the tathāgatas, “If they see that someone is Teaching this Sublime Golden Light, They should go to that place And come before that person. “

source: །དེ་ཡི་དྲུང་དུ་འགྲོ་བར་བྱ། །མདོ་འདི་བསམ་གྱིས་མི་ཁྱབ་པས། །ཡོན་ཏན་མང་པོ་སྤྱོད་བྱེད་ཅིང་། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་མེད་ལས། །སེམས་ཅན་རྣམས་ནི་ཐར་བར་བྱེད།
en: This sūtra is inconceivable And gives rise to an ocean of qualities, And it liberates all beings From the endless ocean of suffering. “

source: །ང་ཡི་མདོ་འདི་རྣམ་བལྟས་ན། །ཐོག་མ་བར་དང་ཐ་མར་དགེ།
en: I have looked upon this sūtra, And it is good in its beginning, middle, and end.

source: །ཤིན་ཏུ་ཟབ་པས་དཔག་པར་དཀའ།
en: It is very profound and beyond evaluation.

source: །དཔེ་དག་གིས་ནི་ཟླ་བྱར་མེད།
en: There is no analogy that is equal to it. “

source: །གང་གཱའི་བྱེ་མ་ས་ཆེན་རྡུལ། །རྒྱ་མཚོའི་ཆུ་དང་ནམ་མཁའ་དང་། །རི་བྲག་ཐམས་ཅད་གང་གིས་ཀྱང་། །ཆ་ཤས་ཙམ་ཡང་དཔེར་བྱར་མེད།
en: The Ganges sands and the great earth’s particles, The water in the oceans and the sky, And even all the mountains and rocks Cannot serve as even a fraction of an analogy for it. “

source: །ཆོས་དབྱིངས་ཟབ་མོར་འཇུག་འདོད་ན། །མདོ་འདི་སྔར་ནི་མཉན་པར་བྱ།
en: If someone wishes to enter the Dharma realm, They should first listen to this sūtra.

source: །ཆོས་ཉིད་མཆོད་རྟེན་གང་ན་བར། །ཟབ་མོ་ཤིན་ཏུ་བདེ་བར་གནས།
en: A stūpa that is the nature of the Dharma Is a profound and extremely blissful location. “

source: །མཆོད་རྟེན་འདི་ཡི་ནང་དག་ཏུ། །ཤཱཀྱ་ཐུབ་པ་ང་ཡིས་ནི། །ཡིད་འོང་སྒྲ་དབྱངས་དམ་པ་ཡིས། །མདོ་སྡེ་འདི་བཤད་མཐོང་བར་འགྱུར།
en: And they will see me, Śākyamuni, inside this stūpa, Teaching this sūtra with a Sublime, beautiful voice. “

source: །དེས་ན་གྲངས་ཚད་བསམ་དཀའ་བའི། །བསྐལ་པ་བྱེ་བ་སྙེད་དུ་ནི། །ལྷ་དང་མི་ཡི་ནང་སྐྱེས་ནས། །རྟག་ཏུ་བདེ་བ་མཆོག་མྱོང་འགྱུར།
en: They will then be reborn as devas and humans And will experience perfect happiness For an incalculable number Of many millions of eons. “

source: །མདོ་སྡེ་འདི་ནི་མཉན་པ་ཡིས། །བདག་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི། །བསོད་ནམས་ཕུང་པོ་འཐོབ་འགྱུར་ཞེས། །དེ་སྙམ་དུ་ནི་བསམ་པར་བྱ།
en: They should think this thought: ‘Through listening to this sūtra, I have attained an inconceivable Accumulation of merit.’ “

source: །གལ་ཏེ་མེ་ཆེན་ཕུང་པོ་དག །དཔག་ཚད་བརྒྱ་ནི་གང་གྱུར་ཀྱང་། །མདོ་སྡེའི་རྒྱལ་པོ་འདི་མཉན་ཕྱིར། །དཀའ་བ་མེད་པར་འགྲོ་བར་བྱ།
en: If there is a great mass of fire That is a hundred yojanas across, They should, in order to listen to this sūtra, Traverse it without hesitation. “

source: །དེ་ཡི་གནས་སུ་ཕྱིན་ནས་ནི། །འདི་འདྲའི་མདོ་འདི་ཐོས་གྱུར་ན། །སྡིག་པའི་ལས་རྣམས་འབྱང་འགྱུར་ཞིང་། །རྨི་ལམ་ངན་པ་སེལ་བར་འགྱུར།
en: When they have arrived at that place And have heard such a sūtra as this, They will be purified of their bad karma, And bad dreams will be dispelled. “

source: །གཟའ་སྐར་མ་རུངས་ལྟས་ངན་དང་། །བྱད་སྟེམས་ལོག་པའི་གདོན་ལ་སོགས། །མདོ་སྡེ་འདི་ནི་ཐོས་པའི་ཚེ། །སྡིག་པ་མང་པོ་སྤོང་བར་བྱེད།
en: The malevolent planets and lunar asterisms, Bad omens, spirits from sorcery, evil demons, And so on, will all forsake their evil actions At the time when this sūtra is heard. “

source: །སྟན་མཐོ་མཆོག་ནི་རབ་བརྒྱན་ནས། །རབ་གཙང་པདྨ་འདྲ་བ་ལ།
en: Perfectly adorn an excellent high throne That is perfectly clean and resembles a lotus.

source: །ཆོས་སྨྲ་སྟེང་དུ་ཕྱིན་ནས་ནི། །ཀླུ་ཆེན་ལྟ་བུར་འདུག་པར་བྱ།
en: The dharmabhāṇaka should ascend it, Like a great seated nāga. “

source: །དེ་ལ་བདེ་བར་འདུག་ནས་ནི། །ཟབ་མོའི་མདོ་འདི་བཤད་པར་བྱ།
en: When he is seated there comfortably, He should give the teaching of this sūtra.

source: །ཡི་གེར་བྲིས་ནས་ཀློག་འཛིན་དང་། །དེ་ཡི་དོན་ནི་བཤད་པར་བྱ།
en: He should have it written out, read it out loud, And give the teaching of its meaning. “

source: །ཆོས་སྨྲ་སྟན་ནི་སྤངས་ནས་ནི། །ཕྱོགས་གཞན་དག་ཏུ་སོང་གྱུར་ཀྱང་། །ཁྲི་སྟན་མཐོན་པོ་དེ་ལས་ནི། །ཆོ་འཕྲུལ་མཚན་མ་མང་འབྱུང་བ།
en: When the dharmabhāṇaka has left that seat, Even if he has gone to another land There will be many miraculous signs That will appear from that high throne. “

source: །རེས་འགའ་ཆོས་སྨྲ་མཁན་པོའི་གཟུགས། །སྟན་མཐོ་སྟེང་ན་འདུག་པར་མཐོང་།
en: Sometimes the dharmabhāṇaka’s form Will be seen sitting on that high throne.

source: །རེས་འགའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་མཐོང་།
en: Sometimes it will be the Buddha Bhagavat Or a bodhisattva who is seen. “

source: །རེས་འགའ་ཀུན་དུ་བཟང་པོའི་གཟུགས།
en: Sometimes it will be the form of Samantabhadra.

source: །རེས་འགའ་འཇམ་དཔལ་ལྟ་བུ་དང་།
en: Sometimes it will resemble Mañjuśrī.

source: །རེས་འགའ་བྱམས་པ་གཙོ་བོའི་གཟུགས། །སྟན་མཐོའི་སྟེང་ན་འདུག་པར་མཐོང་།
en: Sometimes Lord Maitreya Will be seen upon that high throne. “

source: །རེས་འགའ་ཡ་མཚན་མཚན་མ་དང་། །ལྷ་ནི་མང་པོ་རྣམས་ཀྱི་གཟུགས། །ཡུད་ཙམ་དུ་ནི་མཐོང་གྱུར་ཀྱང་། །དེ་མ་ཐག་ཏུ་མི་སྣང་འགྱུར།
en: Sometimes marvelous signs, The forms of many devas, Will be seen for just a moment And then will instantly disappear. “

source: །བཀྲ་ཤིས་མང་པོ་རྫོགས་བྱེད་པས། །བྱས་པ་ཐམས་ཅད་ཡིད་བཞིན་འགྲུབ། །ཡོན་ཏན་རྣམས་ནི་ཡོངས་རྫོགས་པར། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་གསུངས།
en: This will perfect many good fortunes; All deeds will be successful, as wished for; Good qualities will be perfected— That is what the Bhagavat has said. “

source: །མཆོག་ཏུ་རྣམ་རྒྱལ་གྲགས་དང་ལྡན།
en: There will be supreme victory and renown.

source: །ཉོན་མོངས་མང་པོ་ཞི་བར་བྱེད།
en: Many kleśas will come to an end.

source: །ཕ་རོལ་དགྲ་རྣམས་རབ་ཏུ་སེལ། །གཡུལ་འགྱེད་ཚེ་ན་རྟག་པར་རྒྱལ།
en: Opposing enemies will be completely dispelled, And there will always be victory in battle. “

source: །རྨི་ལམ་ངན་པ་ཐམས་ཅད་མེད།
en: There will not be any bad dreams.

source: །དུག་དང་གནོད་པ་མང་པོ་ཞི།
en: Many poisons and harms will cease to be.

source: །ལས་གསུམ་སྡིག་པ་ཅི་བྱས་པ། །མདོ་སྡེའི་མཐུ་ཡིས་བྱང་བར་བྱེད།
en: Whichever of the three bad actions is done, They will be purified by the power of the sūtra. “

source: །འཛམ་བུའི་གླིང་ནི་འདི་དག་ཀུན། །གྲགས་པ་ཀུན་དུ་རྒྱས་པར་འགྱུར།
en: There will be fame that will spread Throughout the entirety of this Jambudvīpa.

source: །འཁོན་འཛིན་དགྲ་ནི་ཇི་སྙེད་པ། །ཕན་ཚུན་འཁོན་ནི་གཏོང་བར་འགྱུར།
en: All the enemies that hold grievances Will direct their grievances toward each other. “

source: །གལ་ཏེ་དགྲ་ནི་ཕྱིན་གྱུར་ཀྱང་། །མིང་ཐོས་ཙམ་གྱིས་ལྡོག་འགྱུར་བས།
en: Even if there is an enemy that comes, Just through hearing its name they will be repelled.

source: །མཚོན་ཆ་གཡོ་བ་མི་ལྟོས་པས། །དགྲ་གཉིས་དགའ་བ་སྐྱེ་བར་འགྱུར། །ཚངས་རྒྱལ་དང་ནི་བརྒྱ་བྱིན་དབང་། །འཇིག་རྟེན་སྐྱོང་དང་རྒྱལ་ཆེན་བཞི། །ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་དང་། །སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས། །ཀླུ་ཡི་རྒྱལ་པོ་མ་དྲོས་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་།
en: The two parties will become happy And not rely on waving weapons. “

source: །མི་འམ་ཅི་དང་རོལ་མོའི་ལྷ། །ལྷ་མོ་ཡིན་དང་གསེར་འདབ་བདག །ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་དང་། །དཔལ་གྱི་ལྷ་མོ་ཆེན་མོ་དང་། །འདི་ལ་སོགས་པ་ལྷ་ཡི་གཙོ། །སོ་སོར་ལྷ་ཚོགས་ཁྲིད་ནས་ནི། །སངས་རྒྱས་རྣམས་ལ་མཆོད་པར་བྱེད། །དཀོན་མཆོག་ཆོས་ནི་བསམ་མི་ཁྱབ། །རྟག་པར་དགའ་བའི་སེམས་ཀྱིས་ནི། །མདོ་སྡེ་ལ་ནི་བཀུར་སྟི་བྱེད།
en: The Brahmā king and Śakra, The world guardians, the Four Mahārājas, The yakṣa Vajrapāṇi, and The great general Saṃjñeya; “The king of nāgas, Anavatapta; The king of nāgas, Sāgara; The kinnaras and devas of music; The asuras and the lord of the garuḍas; “The great goddess Sarasvatī And the great goddess Śrī— Those and the other lords of devas, Leading their own deva assemblies, “Will make offerings to the buddhas, And with minds that are always joyful, They will render homage to the sūtra, To this inconceivable jewel of the Dharma. “

source: །འདི་ལ་སོགས་པའི་ལྷ་མང་པོ། །ཐམས་ཅད་ལྷན་ཅིག་འགྲོགས་ནས་ནི། །བསོད་ནམས་སྒྲུབ་པ་རྣམ་བལྟས་ནས། །ལྷན་ཅིག་འདི་སྐད་སྨྲ་བར་བྱེད། །སེམས་ཅན་འདི་དག་རབ་ཏུ་ལྟོས།
en: These and many other devas Will all gather together, Look at those who accomplish merit, And then they will say to one another: “ ‘Regard these beings well!

source: །བསོད་ནམས་ཡོན་ཏན་ཆེ་ལྡན་ཞིང་།
en: They have great merit and qualities!

source: །དགེ་རྩ་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་ནི། །བདག་ཅག་ལྷ་གནས་སྐྱེ་འགྱུར་ཟེར།
en: Through the power of their diligence in good roots, They will be reborn with us in our paradises. “ ‘

source: །མདོ་སྡེ་ཟབ་མོ་མཉན་པའི་ཕྱིར། །གུས་པའི་སེམས་ཀྱིས་དེར་འོངས་ནས།
en: With veneration they have gone there To listen to this profound sūtra.

source: །ཡང་དག་ཆོས་ནི་བཀུར་བའི་ཕྱིར། །ཆོས་ཀྱི་མཆོད་རྟེན་མཆོད་པར་བྱེད།
en: They make offerings to the stūpa of the Dharma In order to pay homage to the true Dharma. “ ‘

source: །སེམས་ཅན་ཀུན་ལ་སྙིང་བརྩེ་བས། །ཕན་པ་ཆེན་པོ་བྱེད་པས་ན། །མདོ་སྡེ་ཟབ་མོ་འདི་དག་གི། །ཆོས་ཀྱི་རིན་ཆེན་སྣོད་ཀྱང་བྱེད།
en: They have compassion for all beings And therefore create a great benefit for them, Thus creating vessels for the Dharma jewel That is comprised of these profound sūtras. “ ‘

source: །ཆོས་ཀྱི་སྒོ་འདིར་གང་ཞུགས་པ། །ཆོས་ཉིད་ལ་ནི་འཇུག་འགྱུར་བས། །མདོ་སྡེ་གསེར་འོད་དམ་པ་འདི། །རྩེ་གཅིག་སེམས་ཀྱིས་མཉན་པར་བྱ།
en: Those who enter this Dharma gate Will have entered into the nature of the Dharma. They will listen with a one-pointed mind To this Sūtra of the Sublime Golden Light. “ ‘

source: །སངས་རྒྱས་བརྒྱ་སྟོང་ཚད་མེད་ལ། །གང་ཟག་དེ་དག་མཆོད་པས་ན། །དགེ་བའི་རྩ་བ་དེ་དབང་གིས། །མདོ་སྡེ་འདི་ནི་ཐོས་པ་ཡིན། །འདི་ལྟར་ལྷ་ཡི་བདག་པོ་དང་། །ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་དང་། །དཔལ་གྱི་ལྷ་མོ་དེ་དང་ནི།
en: As those individuals have made offerings To countless hundreds of thousands of buddhas, It is through the power of those good roots That they are listening to this sūtra. “ ‘

source: །རྒྱལ་ཆེན་རིས་བཞིའི་ལྷ་རྣམས་དང་། །གནོད་སྦྱིན་འཁོར་ནི་གྲངས་མེད་པ། །དཔའ་ཞིང་རྫུ་འཕྲུལ་ལྡན་པ་རྣམས། །སོ་སོར་ཕྱོགས་བཞི་དག་ནས་ནི། །རྟག་ཏུ་འོངས་ནས་སྐྱོབ་པར་བྱེད། །ཉི་ཟླ་བརྒྱ་བྱིན་ལྷ་དབང་དང་། །རླུང་དང་ཆུ་དང་མེ་ཡི་ལྷ། །ཁྱབ་འཇུག་དང་ནི་ཕྲག་ཆེན་དང་།
en: In this way, the lords of devas, And the goddess Sarasvatī, And the goddess Śrī, And the devas of the Four Mahārājas, “ ‘And countless retinues of yakṣas Who have courage and miraculous powers Will always come from each of the Four directions and give protection. “ ‘

source: །གཤིན་རྗེ་སྤོབས་པ་ལྷ་མོ་དང་། །འཇིག་རྟེན་མགོན་པོ་ལ་སོགས་པ། །རབ་དཔལ་གཟི་ལྡན་ཐམས་ཅད་ཀུན། །མདོ་སྡེ་འཛིན་པ་སྲུང་བྱེད་པས། །ཉིན་མཚན་རྟག་པར་ཡོང་མི་འབྲལ། །གནོད་སྦྱིན་རྒྱལ་པོ་སྟོབས་པོ་ཆེ། །མཐུ་ཆེན་དང་ནི་དབང་ཕྱུག་དང་། །གཙོ་བོ་ཡང་དག་ཤེས་ལ་སོགས།
en: Sūrya, Soma, Śakra, the lord of devas, Vāyu, Varuṇa, and Hutāśana, Viṣṇu, and Skanda, And Yama and the goddess Sarasvatī, “ ‘The world guardians, and so on, All those who have splendor and magnificence Protect those who keep the sūtra, And so are never apart from them day or night. “ ‘

source: །གནོད་སྦྱིན་ཉི་ཤུ་རྩ་བརྒྱད་དང་། །གཞན་ཡང་གནོད་སྦྱིན་བརྒྱ་སྟོང་རྣམས། །རྫུ་འཕྲུལ་སྟོབས་ཆེན་ལྡན་པ་དག །རྟག་པར་འཇིགས་པའི་གནས་རྣམས་སུ། །ཉེར་འོངས་གང་ཟག་དེ་སྲུང་བྱེད།
en: The mighty lords of the yakṣas, Nārāyaṇa and Maheśvara, Lord Saṃjñeya, and all the others; The twenty-eight yakṣas; “ ‘And also the hundred thousand yakṣas Who have miraculous powers and great might Will always come to places of danger And give protection to those individuals. “ ‘

source: །ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་རྒྱལ། །འཁོར་ནི་ལྔ་བརྒྱ་བཅས་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་ཚོགས། །རྟག་པར་ཉེར་འོངས་དེ་སྲུང་བྱེད། །རིན་ཆེན་རྒྱལ་པོ་གནོད་སྦྱིན་དབང་། །དེ་བཞིན་རྫོགས་བཟང་རྒྱལ་པོ་དང་། །འབྲོག་གནས་དང་ནི་ཀུ་པེ་ར། །ཟས་སྦྱིན་ཁ་དོག་སེར་པོ་དང་།
en: Vajrapāṇi, the king of yakṣas, With a retinue of five hundred And a great assembly of bodhisattvas Will always come and give protection to them. “ ‘

source: །འདི་ལ་སོགས་པའི་གནོད་སྦྱིན་རྒྱལ། །སོ་སོར་གཡོག་འཁོར་ལྔ་བརྒྱར་བཅས། །ཐམས་ཅད་ཉེར་འོང་སྲུང་བར་བྱེད། །སྣ་ཚོགས་སྡེ་དང་དྲི་ཟ་དང་། །འདམ་བུ་རྒྱལ་པོ་རྟག་ཏུ་རྒྱལ།
en: Maṇirāja, the lord of yakṣas, And similarly, King Pūrṇabhadra, Aṭāvaka, Kubera, Piṅgala, and Kapila— “ ‘These and other yakṣa kings, Together with retinues of five hundred yakṣas, Will all come and give their protection. “ ‘

source: །ནོར་བུ་གཙུག་དང་ནེ་གན་དང་། །ཆར་པའི་དབང་པོ་དེ་དག་དང་། །མཆོག་ཏུ་རྒྱལ་བ་ནག་པོ་ཆེ། །སུ་བརྞ་དང་ཀེ་ཤ་དང་། །པཉྩི་ཀ་དང་ར་རྐང་དང་། །དེ་བཞིན་སྐལ་བ་ཆེན་པོ་དང་། །པྲ་མ་ལི་ཆུང་ཆོས་སྐྱོང་དང་། །སྤྲེའུ་རྣམས་ཀྱི་ནི་རྒྱལ་པོ་དང་། །ཁབ་སྤུ་དང་ནི་ཉི་མའི་གཉེན། །རིན་ཆེན་གཙུག་ཕུད་སྲུང་བར་བྱེད། །པྲ་ནི་ལི་ཆེན་ན་ཀུ་ལ། །བདུན་པ་དང་ནི་འདོད་མཆོག་དང་།
en: Citrasena and Gandharva, Jinarāja and Jinarṣabha, Maṇikaṇṭha and Nīlakaṇṭha, Varṣādhipati, all those, “ ‘And Mahāgrāsa and Mahākāla, And similarly also Svarṇakeśin, Pāñcika, and Chagalapāda, And similarly also Mahābhāga, “ ‘Praṇālin and Mahāpāla, King of the Monkeys, Sūciroma and Sūryamitra, And also Ratnakeśa will give protection. “ ‘

source: །མཐུ་བོ་ཆེ་དང་གངས་རི་དང་། །བདེ་བའི་རི་ཡང་དེ་བཞིན་ཏེ། །ཐམས་ཅད་རྫུ་འཕྲུལ་ཆེ་ལྡན་ཞིང་། །རབ་དཔའ་མཐུ་སྟོབས་ལྡན་པ་ཡང་།
en: Mahāpraṇālin and Nakula, Kāmaśreṣṭha and Candana, Nāgāyana and Haimavata, And similarly also Sātāgirista— “ ‘All of them have great miraculous powers, Are very courageous and mighty.

source: །མདོ་སྡེ་འདི་འཛིན་མཐོང་གྱུར་ན། །ཐམས་ཅད་འོངས་ནས་སྲུང་བར་བྱེད། །མ་དྲོས་ཀླུ་ཡི་རྒྱལ་པོ་དང་། ཀླུ་ཡི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། བཏང་བཟུང་དང་ནི་ཨེ་ལའི་འདབ། །དགའ་བོ་དང་ནི་ཉེ་དགའ་བོ།
en: If they see someone who keeps this sūtra, They will all come and give their protection. “ ‘
